package com.courier.sdk.constant;

/**
 * app响应结果状态枚举
 *
 */
public enum CodeEnum {
	C1000(1000,	""),
	C1001(1001,	"网络异常，再刷刷试试"),//参数格式错误
	C1002(1002,	"请输入正确的手机号码"),//手机号不正确
	C1003(1003,	"您的手机号码已经被注册"),
	C1004(1004,	""),//查件接口查到件但不是当前快递员的
    C1005(1005,	"请输入正确的验证码"),
    C1006(1006,	"验证码获取失败，请稍后再试"),
	C1007(1007,	"您的请求太过频繁，请稍后再试"),
	C1008(1008,	"验证码不能为空"),//验证码
	C1009(1009,	"密码不能为空"),//密码不为空
	C1010(1010,	"通信功能升级中，敬请期待重新上线"),
	C1012(1012,	"登录失败"),//登录失败
    C1033(1033,	"网络异常，再刷刷试试"),//uuid无效
    C1034(1034,	"网络异常，再刷刷试试"),//必填参数为空,包括各种类型参数 用户类型，订单类型等
    C1036(1036,	"网络异常，再刷刷试试"),//参数的值不正确
	C1037(1037,	"快递员录入"),
    C1069(1069,	"网络不给力"),
    C1072(1072,	"密码错误"),
	C1073(1073,	"原密码错误"),
	C1077(1077,	""),
	C1079(1079,	"您的意见我们已经收到，我们将尽快评估并根据您的反馈意见对系统做出调整，谢谢"),

    C1080(1080,	"账号不能为空"),
    C1081(1081,	"该账号不存在"),
    C1082(1082,	"快递上门通知短信发送成功"),
    C1083(1083,	"签收成功"),
    C1084(1084,	"异常签收提交成功"),
    C1085(1085,	"该单号不是圆通单号"),
    C1086(1086,	"该单号已被使用，不能再次寄件"),
    C1089(1089,	"快件已揽收"),
    C1090(1090,	"快件已揽收，请打印电子面单"),
    C1091(1091,	"短信发送失败，请重试"),
    C1092(1092,	"这是一个固定电话，短信发送不成功"),
    C1093(1093,	"同步成功"),
    C1094(1094,	"同步不成功，请重试"),
    C1095(1095,	"该快件无详细信息"),
	C1096(1096,	"该面单号无效(或已被使用)"),
    C1097(1097,	"这个包裹没有指派给你哦"),//无权查看此订单
	C1098(1098,	"运单号为字母或数字"),//运单号为字母或数字

	C2000(2000, "网络异常，再刷刷试试"),//请求金刚接口返回错误
	C2001(2001, "网络异常，再刷刷试试"),//请求对象错误
	C2003(2003, "网络异常，再刷刷试试"),//系统异常
	C2004(2004, "网络异常，再刷刷试试"),//AES解密未通过
	C2005(2005, "网络异常，再刷刷试试"),//cMode错误
	C2006(2006, "登录失败，请重新登录"),//金刚登录验证失败，请重新登录
	C2007(2007, "短信验证失败，请重新验证"),
	C2008(2008, "网络异常，再刷刷试试"),//token不能为空
	C2009(2009, "网络异常，再刷刷试试"),//token验证失败
	C2010(2010, "网络异常，再刷刷试试"),//获取用户gps失败
	C2011(2011,	"签收失败"),
	C2012(2012,	"该快件已被签收"),
	C2013(2013,	"您所处区域的订单已被抢"),       //接单失败
	C2014(2014,	"该快件不是圆通件或者已被签收、未做派件扫描"),
	C2015(2015,	"订单不存在(或已关闭)"),
	C2016(2016,	"订单存在了(勿重复推送)"),
	C2017(2017,	"该订单已揽收，不能取消"),
	C2018(2018,	"网络异常，再刷刷试试"),//从金刚系统中获取branch信息错误
	C2019(2019,	"该订单已取消(勿重复取消)"),
	C2020(2020,	"无法打印电子面单，您所在的网点没有电子面单号余额了,请尽快联系网点申购"),
	C2021(2021,	"该订单已被抢，无法重新指定快递员"),

	C3000(3000,	"网络异常，再刷刷试试"),//请求支付模块出错
	C3001(3001, "已经绑定过支付宝"),
	C3002(3002,	"请求支付宝接口失败"),
	C3003(3003,	"支付宝账户未进行实名认证"),
	C3004(3004,	"费用类型不正确"),
	C3005(3005,	"订单状态非支付成功，不能做此操作"),
	C3006(3006,	"未查询到绑定结果"),
	C3007(3007,	"该账户还未绑定"),
	C3009(3009,	"该账户名字与支付宝真实姓名不匹配"),
	C3011(3011,	"不能取消支付，该订单已超过24小时"),
	C3012(3012,	"不能退款，该订单没有超过24小时，请选择取消支付"),
	C3013(3013,	"不能退款，该订单已超过3个月"),
	C3014(3014,	"支付超时，现取消订单支付"),
	C3015(3015, "超过支付规定次数，暂停支付宝支付"),
	C3016(3016, "你扫错码了"),


	C4001(4001,	"账户审核未通过"),
	C4002(4002,	"无权查看"),
	C4003(4003,	"工号已被注册"),
	C4004(4004,	"发送短信次数超过限制"),
	C4005(4005,	"没有权限发PUSH"),


	C5001(5001,	"图片上传不完整"),
	C5002(5002,	"实名认证失败"),
	;

	private Integer code;
	private String desc;

	private CodeEnum(Integer code, String desc) {
		this.code = code;
		this.desc = desc;
	}

	public static String getNameByCode(Integer code) {
		for (CodeEnum c : CodeEnum.values()) {
			if (c.getCode().equals(code)) {
				return c.getDesc();
			}
		}
		return null;
	}

	public Integer getCode() {
		return code;
	}

	public void setCode(Integer code) {
		this.code = code;
	}

	public String getDesc() {
		return desc;
	}

	public void setDesc(String desc) {
		this.desc = desc;
	}
}
